#!/usr/bin/env python
# -*- coding: utf-8 -*-
from pprint import pprint

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
a = shops['ашан']
p = shops['пятерочка']
m = shops['магнит']

sweets = {
    'печенье': [
        {'shop': 'пятерочка', 'price': p[0]['price']},
        {'shop': 'ашан', 'price': a[0]['price']},
    ],
    'конфеты': [
        {'shop': 'магнит', 'price': m[1]['price']},
        {'shop': 'пятерочка', 'price': p[1]['price']},
    ],
    'карамель': [
        {'shop': 'магнит', 'price': m[2]['price']},
        {'shop': 'ашан', 'price': a[2]['price']},
    ],
    'пирожное': [
        {'shop': 'пятерочка', 'price': p[3]['price']},
        {'shop': 'магнит', 'price': m[3]['price']},
    ]
}
# Указать надо только по 2 магазина с минимальными ценами
pprint(sweets)
